spiffykahuna/master_thesis/stm32_coffee_proxy/src/stdio/printf.c
/**************************************************************************//*****
* @file     printf.c
* @brief    Implementation of several stdio.h methods, such as printf(),
*           sprintf() and so on. This reduces the memory footprint of the
*           binary when using those methods, compared to the libc implementation.
********************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#include "stm32f10x.h"
//#include "stm32_eval.h"

/** Maximum string size allowed (in bytes). */
#define MAX_STRING_SIZE         100


#ifndef STDOUT_USART
#define STDOUT_USART USART1
#endif

#ifndef STDERR_USART
#define STDERR_USART USART1
#endif

#ifndef STDIN_USART
#define STDIN_USART USART1
#endif



int dbl2stri(char *outbfr, double dbl, int dec_digits)
{
   static char local_bfr[81] ;
   char *output = (outbfr == 0) ? local_bfr : outbfr ;

   //*******************************************
   //  extract negative info
   //*******************************************
   int negative = (dbl < 0.0) ? 1 : 0 ;
   if (negative) {
      *output++ = '-' ;
      dbl *= -1.0 ;
   }

   //**************************************************************************
   //  construct fractional multiplier for specified number of digits.
   //  Note that we draw one digit more than requested in order
   //  to handle last-digit rounding.
   //**************************************************************************
   uint32_t mult = 10 ;
   uint32_t idx ;
   for (idx=0; idx < dec_digits; idx++)
      mult *= 10 ;

   // printf("mult=%u\n", mult) ;
   int wholeNum = (int) dbl ;
   int decimalNum = (int) ((dbl - wholeNum) * mult);
   //  round off low digit
   decimalNum += 5 ;
   decimalNum /= 10 ;

   //*******************************************
   //  convert integer portion
   //*******************************************
   char tbfr[40] ;
   idx = 0 ;
   while (wholeNum != 0) {
      tbfr[idx++] = '0' + (wholeNum % 10) ;
      wholeNum /= 10 ;
   }
   // printf("%.3f: whole=%s, dec=%d\n", dbl, tbfr, decimalNum) ;
   if (idx == 0) {
      *output++ = '0' ;
   } else {
      while (idx > 0) {
         *output++ = tbfr[idx-1] ;  //lint !e771
         idx-- ;
      }
   }
   if (dec_digits > 0) {
      *output++ = '.' ;

      //*******************************************
      //  convert fractional portion
      //*******************************************
      idx = 0 ;
      while (decimalNum != 0) {
         tbfr[idx++] = '0' + (decimalNum % 10) ;
         decimalNum /= 10 ;
      }
      //  pad the decimal portion with 0s as necessary;
      //  We wouldn't want to report 3.093 as 3.93, would we??
      while (idx < dec_digits) {
         tbfr[idx++] = '0' ;
      }
      // printf("decimal=%s\n", tbfr) ;
      if (idx == 0) {
         *output++ = '0' ;
      } else {
         while (idx > 0) {
            *output++ = tbfr[idx-1] ;
            idx-- ;
         }
      }
   }
   *output = 0 ;

   //  prepare output
   output = (outbfr == 0) ? local_bfr : outbfr ;
   return strlen(output) ;
}




/** Required for proper compilation. */
struct _reent r = {0, (FILE *) 0, (FILE *) 1, (FILE *) 0};
//struct _reent *_impure_ptr = &r;

/**
* @brief  Writes a character inside the given string. Returns 1.
*
* @param  pStr   Storage string.
* @param  c    Character to write.
*/
signed int PutChar(char *pStr, char c)
{
    *pStr = c;
    return 1;
}


/**
* @brief  Writes a string inside the given string.
*
* @param  pStr     Storage string.
* @param  pSource  Source string.
* @return  The size of the written
*/
signed int PutString(char *pStr, const char *pSource)
{
    signed int num = 0;

    while (*pSource != 0) {

        *pStr++ = *pSource++;
        num++;
    }

    return num;
}


/**
* @brief  Writes an unsigned int inside the given string, using the provided fill &
*         width parameters.
*
* @param  pStr  Storage string.
* @param  fill  Fill character.
* @param  width  Minimum integer width.
* @param  value  Integer value.
*/
signed int PutUnsignedInt(
    char *pStr,
    char fill,
    signed int width,
    unsigned int value)
{
    signed int num = 0;

    /* Take current digit into account when calculating width */
    width--;

    /* Recursively write upper digits */
    if ((value / 10) > 0) {

        num = PutUnsignedInt(pStr, fill, width, value / 10);
        pStr += num;
    }

    /* Write filler characters */
    else {

        while (width > 0) {

            PutChar(pStr, fill);
            pStr++;
            num++;
            width--;
        }
    }

    /* Write lower digit */
    num += PutChar(pStr, (value % 10) + '0');

    return num;
}


/**
* @brief  Writes a signed int inside the given string, using the provided fill & width
*         parameters.
*
* @param pStr   Storage string.
* @param fill   Fill character.
* @param width  Minimum integer width.
* @param value  Signed integer value.
*/
signed int PutSignedInt(
    char *pStr,
    char fill,
    signed int width,
    signed int value)
{
    signed int num = 0;
    unsigned int absolute;

    /* Compute absolute value */
    if (value < 0) {

        absolute = -value;
    }
    else {

        absolute = value;
    }

    /* Take current digit into account when calculating width */
    width--;

    /* Recursively write upper digits */
    if ((absolute / 10) > 0) {

        if (value < 0) {

            num = PutSignedInt(pStr, fill, width, -(absolute / 10));
        }
        else {

            num = PutSignedInt(pStr, fill, width, absolute / 10);
        }
        pStr += num;
    }
    else {

        /* Reserve space for sign */
        if (value < 0) {

            width--;
        }

        /* Write filler characters */
        while (width > 0) {

            PutChar(pStr, fill);
            pStr++;
            num++;
            width--;
        }

        /* Write sign */
        if (value < 0) {

            num += PutChar(pStr, '-');
            pStr++;
        }
    }

    /* Write lower digit */
    num += PutChar(pStr, (absolute % 10) + '0');

    return num;
}


/**
* @brief  Writes an hexadecimal value into a string, using the given fill, width &
*         capital parameters.
*
* @param pStr   Storage string.
* @param fill   Fill character.
* @param width  Minimum integer width.
* @param maj    Indicates if the letters must be printed in lower- or upper-case.
* @param value  Hexadecimal value.
*
* @return  The number of char written
*/
signed int PutHexa(
    char *pStr,
    char fill,
    signed int width,
    unsigned char maj,
    unsigned int value)
{
    signed int num = 0;

    /* Decrement width */
    width--;

    /* Recursively output upper digits */
    if ((value >> 4) > 0) {

        num += PutHexa(pStr, fill, width, maj, value >> 4);
        pStr += num;
    }
    /* Write filler chars */
    else {

        while (width > 0) {

            PutChar(pStr, fill);
            pStr++;
            num++;
            width--;
        }
    }

    /* Write current digit */
    if ((value & 0xF) < 10) {

        PutChar(pStr, (value & 0xF) + '0');
    }
    else if (maj) {

        PutChar(pStr, (value & 0xF) - 10 + 'A');
    }
    else {

        PutChar(pStr, (value & 0xF) - 10 + 'a');
    }
    num++;

    return num;
}



/* Global Functions ----------------------------------------------------------- */


/**
* @brief  Stores the result of a formatted string into another string. Format
*         arguments are given in a va_list instance.
*
* @param pStr    Destination string.
* @param length  Length of Destination string.
* @param pFormat Format string.
* @param ap      Argument list.
*
* @return  The number of characters written.
*/
signed int vsnprintf(char *pStr, size_t length, const char *pFormat, va_list ap)
{
    char          fill;
    unsigned char width;
    signed int    num = 0;
    signed int    size = 0;

    /* Clear the string */
    if (pStr) {

        *pStr = 0;
    }

    /* Phase string */
    while (*pFormat != 0 && size < length) {

        /* Normal character */
        if (*pFormat != '%') {

            *pStr++ = *pFormat++;
            size++;
        }
        /* Escaped '%' */
        else if (*(pFormat+1) == '%') {

            *pStr++ = '%';
            pFormat += 2;
            size++;
        }
        /* Token delimiter */
        else {

            fill = ' ';
            width = 0;
            pFormat++;

            /* Parse filler */
            if (*pFormat == '0') {

                fill = '0';
                pFormat++;
            }

            /* Parse width */
            while ((*pFormat >= '0') && (*pFormat <= '9')) {

                width = (width*10) + *pFormat-'0';
                pFormat++;
            }

            /* Check if there is enough space */
            if (size + width > length) {

                width = length - size;
            }

            /* Parse type */
            switch (*pFormat) {
            case 'd':
            case 'i': num = PutSignedInt(pStr, fill, width, va_arg(ap, signed int)); break;
            case 'u': num = PutUnsignedInt(pStr, fill, width, va_arg(ap, unsigned int)); break;
            case 'x': num = PutHexa(pStr, fill, width, 0, va_arg(ap, unsigned int)); break;
            case 'X': num = PutHexa(pStr, fill, width, 1, va_arg(ap, unsigned int)); break;
            case 's': num = PutString(pStr, va_arg(ap, char *)); break;
            case 'c': num = PutChar(pStr, va_arg(ap, unsigned int)); break;
            case 'f':
            case 'g':
            {
					double dbl = (double)va_arg(ap, double);
					static char bfr[81] ;
					// unsigned slen =
					dbl2stri(bfr, dbl, 6);
					// stuff_talkf("[%s], width=%u, dec_width=%u\n", bfr, width, dec_width) ;
//					bfr[0] = '\0';
					num = PutString(pStr, bfr);
            }
            break;


            default:
                return EOF;
            }

            pFormat++;
            pStr += num;
            size += num;
        }
    }

    /* NULL-terminated (final \0 is not counted) */
    if (size < length) {

        *pStr = 0;
    }
    else {

        *(--pStr) = 0;
        size--;
    }

    return size;
}


/**
* @brief  Stores the result of a formatted string into another string. Format
*         arguments are given in a va_list instance.
*
* @param pStr    Destination string.
* @param length  Length of Destination string.
* @param pFormat Format string.
* @param ...     Other arguments
*
* @return  The number of characters written.
*/
signed int snprintf(char *pString, size_t length, const char *pFormat, ...)
{
    va_list    ap;
    signed int rc;

    va_start(ap, pFormat);
    rc = vsnprintf(pString, length, pFormat, ap);
    va_end(ap);

    return rc;
}


/**
* @brief  Stores the result of a formatted string into another string. Format
*         arguments are given in a va_list instance.
*
* @param pString  Destination string.
* @param length   Length of Destination string.
* @param pFormat  Format string.
* @param ap       Argument list.
*
* @return  The number of characters written.
*/
signed int vsprintf(char *pString, const char *pFormat, va_list ap)
{
   return vsnprintf(pString, MAX_STRING_SIZE, pFormat, ap);
}

/**
* @brief  Outputs a formatted string on the given stream. Format arguments are given
*         in a va_list instance.
*
* @param pStream  Output stream.
* @param pFormat  Format string
* @param ap       Argument list.
*/
signed int vfprintf(FILE *pStream, const char *pFormat, va_list ap)
{
    char pStr[MAX_STRING_SIZE];
    char pError[] = "stdio.c: increase MAX_STRING_SIZE\n\r";

    /* Write formatted string in buffer */
    if (vsprintf(pStr, pFormat, ap) >= MAX_STRING_SIZE) {

        fputs(pError, stderr);
        while (1); /* Increase MAX_STRING_SIZE */
    }

    /* Display string */
    return fputs(pStr, pStream);
}


/**
* @brief  Outputs a formatted string on the DBGU stream. Format arguments are given
*         in a va_list instance.
*
* @param pFormat  Format string.
* @param ap  Argument list.
*/
signed int vprintf(const char *pFormat, va_list ap)
{
    return vfprintf(stdout, pFormat, ap);
}


/**
* @brief  Outputs a formatted string on the given stream, using a variable
*         number of arguments.
*
* @param pStream  Output stream.
* @param pFormat  Format string.
*/
signed int fprintf(FILE *pStream, const char *pFormat, ...)
{
    va_list ap;
    signed int result;

    /* Forward call to vfprintf */
    va_start(ap, pFormat);
    result = vfprintf(pStream, pFormat, ap);
    va_end(ap);

    return result;
}


/**
* @brief  Outputs a formatted string on the DBGU stream, using a variable number of
*         arguments.
*
* @param  pFormat  Format string.
*/
signed int printf(const char *pFormat, ...)
{
    va_list ap;
    signed int result;

    /* Forward call to vprintf */
    va_start(ap, pFormat);
    result = vprintf(pFormat, ap);
    va_end(ap);

    return result;
}


/**
* @brief  Writes a formatted string inside another string.
*
* @param pStr     torage string.
* @param pFormat  Format string.
*/
signed int sprintf(char *pStr, const char *pFormat, ...)
{
    va_list ap;
    signed int result;

    // Forward call to vsprintf
    va_start(ap, pFormat);
    result = vsprintf(pStr, pFormat, ap);
    va_end(ap);

    return result;
}


/**
* @brief  Outputs a string on stdout.
*
* @param pStr  String to output.
*/
signed int puts(const char *pStr)
{
    return fputs(pStr, stdout);
}


/**
* @brief  Implementation of fputc using the DBGU as the standard output. Required
*         for printf().
*
* @param c        Character to write.
* @param pStream  Output stream.
* @param The character written if successful, or -1 if the output stream is
*        not stdout or stderr.
*/
signed int fputc(signed int ch, FILE *pStream)
{
	if(pStream == stdout) {

		USART_SendData(STDOUT_USART, ch);

		/* Loop until the end of transmission */
		while (USART_GetFlagStatus(STDOUT_USART, USART_FLAG_TC) == RESET)
		{}

		return ch;
	} else if (pStream == stderr)
	{
		USART_SendData(STDERR_USART, ch);

		/* Loop until the end of transmission */
		while (USART_GetFlagStatus(STDERR_USART, USART_FLAG_TC) == RESET)
		{}

		return ch;
	} else {
		return -1;
	}
}


/**
* @brief  Implementation of fputs using the DBGU as the standard output. Required
*         for printf().
*
* @param pStr     String to write.
* @param pStream  Output stream.
*
* @return  Number of characters written if successful, or -1 if the output
*          stream is not stdout or stderr.
*/
signed int fputs(const char *pStr, FILE *pStream)
{
    signed int num = 0;

    while (*pStr != 0) {

        if (fputc(*pStr, pStream) == -1) {

            return -1;
        }
        num++;
        pStr++;
    }

    return num;
}

/* --------------------------------- End Of File ------------------------------ */


char * gets(char *pStr)
{
    return (char*) "HAHA";
}

int fgetc(FILE *f)
{
  if(f == stdin)
  {
    while(((USART2->SR) & USART_FLAG_RXNE) == RESET);/* wait until data arrived */
    return (USART2->DR & (uint16_t)0x01FF);          /* return data byte */
  }
  else
  {
    return -1;
  }
}
